app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "I can help you with that"], ["message_id", 6], ["created_at", "2016-04-01 06:21:27.895142"], ["updated_at", "2016-04-01 06:21:27.895142"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2016-04-01 06:24:25.941060"], ["id", 4]]
---
  def create

    @comment = @message.comments.create(comment_params)
    @comment.user_id = current_user.id
    if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "yolo# hashtag"], ["updated_at", "2016-04-01 06:45:23.179891"], ["id", 4]]
---
  def update
  	if @comment.update(comment_params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 6]]
---
  def find_message
    @message = Message.find(params[:message_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 6], ["id", 4]]
---
  def find_comment
  	@comment = @message.comments.find(params[:id])