app/controllers/messages_controller.rb

	def index
		@messages = Message.all.order("created_at DESC")
---
SELECT "messages".* FROM "messages"  ORDER BY created_at DESC

	def update
		if @message.update(message_params)
---
UPDATE "messages" SET "title" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["title", "Any Awesome sublime text 3"], ["updated_at", "2016-03-31 03:27:19.305007"], ["id", 2]]

	def destroy

		@message.destroy
---
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 3]]

	def create
		@message = current_user.messages.build(message_params)
		if @message.save
---
INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Bronzowe Myśli"], ["description", "Swietny kanał polecam 10/10"], ["user_id", 1], ["created_at", "2016-03-31 03:55:54.355781"], ["updated_at", "2016-03-31 03:55:54.355781"]]

	def find_message

		@message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 3]]